# RoomDesignPowerLoadParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomDesignPowerLoadParam Property
ParameterTypeId Class See Also
---
"Specified Power Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomDesignPowerLoadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomDesignPowerLoadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomDesignPowerLoadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace